codesimplefast/Test/UART_TwoBoards_ComIT/BSP/stm32f0xx_Des_Eval.c
  GPIO_InitStruct.Alternate = TIMx_GPIO_AF_CHANNEL1;
  GPIO_InitStruct.Pin = TIMx_GPIO_PIN_CHANNEL1;
  HAL_GPIO_Init(TIMx_GPIO_PORT_CHANNEL1, &GPIO_InitStruct);
  
  HAL_TIM_PWM_Init(htim);
  
    /*##-2- Configure the PWM channels #########################################*/
  /* Common configuration for all channels */
  sConfig.OCMode       = TIM_OCMODE_PWM1;
  sConfig.OCPolarity   = TIM_OCPOLARITY_HIGH;
  sConfig.OCFastMode   = TIM_OCFAST_DISABLE;
  sConfig.OCNPolarity  = TIM_OCNPOLARITY_HIGH;
  sConfig.OCNIdleState = TIM_OCNIDLESTATE_RESET;

  sConfig.OCIdleState  = TIM_OCIDLESTATE_RESET;

  /* Set the pulse value for channel 1 */
  sConfig.Pulse = 333;
  if (HAL_TIM_PWM_ConfigChannel(htim, &sConfig, TIM_CHANNEL_1) != HAL_OK)
  {
    /* Configuration Error */
    return HAL_ERROR;
  }
  
    /*##-3- Start PWM signals generation #######################################*/
  /* Start channel 1 */
  if (HAL_TIM_PWM_Start(htim, TIM_CHANNEL_1) != HAL_OK)
  {
    /* PWM Generation Error */
    return HAL_ERROR;
  }
  
  return HAL_OK;
}
  
  

/**
* @brief  Configures COM port.
* @param  COM: Specifies the COM port to be configured.
*   This parameter can be one of following parameters:    
*     @arg COM1  
* @param  huart: pointer to a UART_HandleTypeDef structure that
*   contains the configuration information for the specified UART peripheral.
* @retval HAL_StatusTypeDef
*/
HAL_StatusTypeDef BSP_COM_Init(COM_TypeDef COM, UART_HandleTypeDef* huart)
{
  GPIO_InitTypeDef gpioinitstruct = {0};
  /*##-1- Enable peripherals and GPIO Clocks #################################*/
  /* Enable GPIO TX/RX clock */
  COMx_TX_GPIO_CLK_ENABLE(COM);
  COMx_RX_GPIO_CLK_ENABLE(COM);
  //MF COMx_TX_GPIO_CLK_ENABLE(COM);
  //MF COMx_RX_GPIO_CLK_ENABLE(COM);

  /* Enable USARTx clock */
  COMx_CLK_ENABLE(COM);
  
  /*##-2- Configure peripheral GPIO ##########################################*/  
  /* UART TX GPIO pin configuration  */
  gpioinitstruct.Pin        = COM_TX_PIN[COM];
  gpioinitstruct.Mode       = GPIO_MODE_AF_PP;
  gpioinitstruct.Speed      = GPIO_SPEED_FREQ_HIGH;//GPIO_SPEED_HIGH;
  gpioinitstruct.Pull       = GPIO_PULLUP;
  gpioinitstruct.Alternate  = COM_TX_AF[COM];
  
  HAL_GPIO_Init(COM_TX_PORT[COM], &gpioinitstruct);

  /* UART RX GPIO pin configuration  */
  //gpioinitstruct.Mode       = GPIO_MODE_INPUT;//  
  gpioinitstruct.Pin        = COM_RX_PIN[COM];
  //gpioinitstruct.Pull       = GPIO_NOPULL;
  gpioinitstruct.Alternate  = COM_RX_AF[COM];
  
  HAL_GPIO_Init(COM_RX_PORT[COM], &gpioinitstruct);
  
  /*##-3- Configure the NVIC for UART ########################################*/
  /* NVIC for USART */
  HAL_NVIC_SetPriority((IRQn_Type)(COM_IRQn[COM]), 0, 1);//ToDo
  HAL_NVIC_EnableIRQ((IRQn_Type)(COM_IRQn[COM]));//ToDo
  
  /* USART configuration */
  huart->Instance = COM_USART[COM];
  if(HAL_UART_Init(huart) != HAL_OK)//In HAL_UART_Init wird HAL_UART_MspInit aufgerufen
  {
    return HAL_ERROR;
  }
  
  /*##-4- jetzt muss noch Interrupt enabled werden ###########################*/
  //__HAL_UART_ENABLE_IT(__HANDLE__, __INTERRUPT__)
  __HAL_UART_ENABLE_IT(huart, UART_IT_RXNE);
  
  return HAL_OK;
}

/**
* @brief  Deconfigures COM port.
* @param  COM: Specifies the COM port to be configured.
*   This parameter can be one of following parameters:    
*     @arg COM1  
* @param  huart: pointer to a UART_HandleTypeDef structure that
*   contains the configuration information for the specified UART peripheral.
* @retval HAL_StatusTypeDef
*/
HAL_StatusTypeDef BSP_COM_DeInit(COM_TypeDef COM, UART_HandleTypeDef* huart)
{
  /*##-1- Reset peripherals ##################################################*/
  COMx_FORCE_RESET(COM);
  COMx_RELEASE_RESET(COM);
  
  /*##-2- Disable peripherals and GPIO Clocks #################################*/
  HAL_GPIO_DeInit(COM_RX_PORT[COM], COM_TX_PIN[COM]);
  HAL_GPIO_DeInit(COM_RX_PORT[COM], COM_RX_PIN[COM]);
  
  /*##-3- Disable the NVIC for UART ##########################################*/
  //HAL_NVIC_DisableIRQ((IRQn_Type)(COM_IRQn[COM]));//ToDo
  
  /* USART configuration */
  huart->Instance = COM_USART[COM];
  if(HAL_UART_DeInit(huart) != HAL_OK)//In HAL_UART_Init wird HAL_UART_MspInit aufgerufen
  {
    return HAL_ERROR;
  }
  return HAL_OK;
}
  

/**
  * @brief  This method returns the STM32F0XX NUCLEO BSP Driver revision
  * @retval version : 0xXYZR (8bits for each decimal, R for RC)
  */
uint32_t BSP_GetVersion(void)
{
  return __STM32F0XX_NUCLEO_BSP_VERSION;
}

/** @addtogroup STM32F0XX_NTC_Functions
  * @{
  */ 

/**
  * @brief  Configures NTC GPIO.
  * @retval None
  */
void BSP_NTC_Init(void)
{
  BSP_ANALOG_SW_Init();
}

/**
  * @brief  DeInit NTC.
  * @note NTC DeInit does not disable the GPIO clock nor disable the Mfx 
  * @retval None
  */
void BSP_NTC_DeInit(void)
{
    BSP_ANALOG_SW_DeInit();
}

/**
  * @brief  Enables NTC on 1-Wire pin
  * @retval None
  */
void BSP_NTC_Enable(void)
{
  BSP_ANALOG_SW_B0_A();
}

/**
  * @brief  Disables NTC on 1-Wire pin
  * @retval None
  */
void BSP_NTC_Disable(void)
{
  BSP_ANALOG_SW_B1_A();
}
/**
  * @}
  */ 



/** @addtogroup STM32F0XX_ANALOG_SWITCH_Functions
  * @{
  */ 

/**
  * @brief  Configures ANALOG_SWITCH GPIO.
  * @retval None
  */
void BSP_ANALOG_SW_Init(void)
{
  GPIO_InitTypeDef  gpioinitstruct;
  
  /* Enable the GPIO_ANALOG_SWITCH Clock */
  ANALOG_SW_GPIO_CLK_ENABLE();

  /* Configure the GPIO_ANALOG_SWITCH pin */
  gpioinitstruct.Pin = ANALOG_SW_PIN;
  gpioinitstruct.Mode = GPIO_MODE_OUTPUT_PP;
  gpioinitstruct.Pull = GPIO_NOPULL;
  gpioinitstruct.Speed = GPIO_SPEED_FREQ_HIGH;
  
  HAL_GPIO_Init(ANALOG_SW_PORT, &gpioinitstruct);
}

/**
  * @brief  DeInit ANALOG_SWITCH.
  * @note ANALOG_SW DeInit does not disable the GPIO clock nor disable the Mfx 
  * @retval None
  */
void BSP_ANALOG_SW_DeInit(void)
{
  GPIO_InitTypeDef  gpio_init_structure;

  /* Turn off LED */
  HAL_GPIO_WritePin(ANALOG_SW_PORT, ANALOG_SW_PIN, GPIO_PIN_RESET);
  /* DeInit the GPIO_LED pin */
  gpio_init_structure.Pin = ANALOG_SW_PIN;
  HAL_GPIO_DeInit(ANALOG_SW_PORT, gpio_init_structure.Pin);
}

/**
  * @brief  Turns ANALOG_SWITCH B1 to A.
  * @retval None
  */
void BSP_ANALOG_SW_B1_A(void)
{
  HAL_GPIO_WritePin(ANALOG_SW_PORT, ANALOG_SW_PIN, GPIO_PIN_SET); 
}

/**
  * @brief  Turns ANALOG_SWITCH B0 to A.
  * @retval None
  */
void BSP_ANALOG_SW_B0_A(void)
{
  HAL_GPIO_WritePin(ANALOG_SW_PORT, ANALOG_SW_PIN, GPIO_PIN_RESET); 
}

/**
  * @brief  Toggles the ANALOG_SWITCH.
  * @retval None
  */
void BSP_ANALOG_SW_Toggle(void)
{
  HAL_GPIO_TogglePin(ANALOG_SW_PORT, ANALOG_SW_PIN);
}

/**
  * @}
  */ 

/** @addtogroup STM32F0XX_NUCLEO_LED_Functions
  * @{
  */ 

/**
  * @brief  Configures LED GPIO.
  * @param  Led: Led to be configured. 
  *         This parameter can be one of the following values:
  * @arg LED2
  * @retval None
  */
void BSP_LED_Init(Led_TypeDef Led)
{
  GPIO_InitTypeDef  gpioinitstruct;
  
  /* Enable the GPIO_LED Clock */
  LEDx_GPIO_CLK_ENABLE(Led);

  /* Configure the GPIO_LED pin */
  gpioinitstruct.Pin = LED_PIN[Led];
  gpioinitstruct.Mode = GPIO_MODE_OUTPUT_PP;
  gpioinitstruct.Pull = GPIO_NOPULL;
  gpioinitstruct.Speed = GPIO_SPEED_FREQ_HIGH;
  
  HAL_GPIO_Init(LED_PORT[Led], &gpioinitstruct);
}

/**
  * @brief  DeInit LEDs.
  * @param  Led: LED to be de-init. 
  *   This parameter can be one of the following values:
  *     @arg  LED2
  * @note Led DeInit does not disable the GPIO clock nor disable the Mfx 
  * @retval None
  */
void BSP_LED_DeInit(Led_TypeDef Led)
{
  GPIO_InitTypeDef  gpio_init_structure;

  /* Turn off LED */
  HAL_GPIO_WritePin(LED_PORT[Led], LED_PIN[Led], GPIO_PIN_RESET);
  /* DeInit the GPIO_LED pin */
  gpio_init_structure.Pin = LED_PIN[Led];
  HAL_GPIO_DeInit(LED_PORT[Led], gpio_init_structure.Pin);
}

/**
  * @brief  Turns selected LED On.
  * @param  Led: Specifies the Led to be set on. 
  *   This parameter can be one of following parameters:
  *     @arg LED2
  * @retval None
  */
void BSP_LED_On(Led_TypeDef Led)
{
  HAL_GPIO_WritePin(LED_PORT[Led], LED_PIN[Led], GPIO_PIN_SET); 
}

/**
  * @brief  Turns selected LED Off.
  * @param  Led: Specifies the Led to be set off. 
  *   This parameter can be one of following parameters:
  *     @arg LED2
  * @retval None
  */
void BSP_LED_Off(Led_TypeDef Led)
{
  HAL_GPIO_WritePin(LED_PORT[Led], LED_PIN[Led], GPIO_PIN_RESET); 
}

/**
  * @brief  Toggles the selected LED.
  * @param  Led: Specifies the Led to be toggled. 
  *   This parameter can be one of following parameters:
  *     @arg LED2
  * @retval None
  */
void BSP_LED_Toggle(Led_TypeDef Led)
{
  HAL_GPIO_TogglePin(LED_PORT[Led], LED_PIN[Led]);
}

/**
  * @}
  */ 

/** @defgroup STM32F0XX_NUCLEO_BUTTON_Functions BUTTON Functions
  * @{
  */ 

/**
  * @brief  Configures Button GPIO and EXTI Line.
  * @param  Button: Specifies the Button to be configured.
  *   This parameter should be: BUTTON_USER
  * @param  ButtonMode: Specifies Button mode.
  *   This parameter can be one of following parameters:   
  *     @arg BUTTON_MODE_GPIO: Button will be used as simple IO
  *     @arg BUTTON_MODE_EXTI: Button will be connected to EXTI line with interrupt
  *                            generation capability  
  * @retval None
  */
void BSP_PB_Init(Button_TypeDef Button, ButtonMode_TypeDef ButtonMode)
{
  GPIO_InitTypeDef gpioinitstruct;

  /* Enable the BUTTON Clock */
  BUTTONx_GPIO_CLK_ENABLE(Button);

